---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceAdjacentSpaceId2
source: html/b3395ba8-d2d2-f34a-193b-6b4fae8db35f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceAdjacentSpaceId2 Property

"Adjacent Space Id (2)"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisSurfaceAdjacentSpaceId2 { get; }
```